Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/housing/owning_a_home/mortgage_arrears/overview_of_mortgage_debt.html.txt.tmx
Source language: en
Languages: ga

source: Overview of mortgage debt
ga: Forbhreathnú ar fhiachas morgáiste

source: • Other sources of information and advice
ga: • Foinsí eile faisnéise agus comhairle

source: If you’re behind in your mortgage payments, you may be worried about losing your home
ga: Má tá fadhbanna agat le do mhorgáiste a íoc, d’fhéadfá bheith buartha go gcaillfeá do theach

source: If you can’t - talk to MABS
ga: Munar féidir leat – labhair le MABS

source: MABS now has a dedicated confidential, free, and independent mortgage arrears service
ga: Tá seirbhís tiomnaithe neamhspleách, faoi rún, saor in aisce ag MABS anois i leith riaráistí morgáiste

source: MABS is a one-stop-shop for mortgage debt advice and referral
ga: Is ionad ilfhreastail é MABS le haghaidh comhairle agus tarchur i leith fiachais mhorgáiste

source: No matter what your situation is, MABS will help you work out the next steps
ga: Is cuma cad é do chás, cabhróidh MABS leat an chéad chéim eile a aimsiú

source: Take control of what happens next
ga: Glac smacht ar cad a tharlóidh anois

source: Call MABS today on 0761 07 2000 for independent information, advice and referral
ga: Cuir glao ar MABS inniu ar 0761 07 2000 chun faisnéis, comhairle agus tarchur neamhspleách a fháil

source: The mortgage on your house, flat or apartment is probably the biggest and most important financial commitment that you have
ga: Gach seans gurb é an morgáiste ar do theach nó ar d'árasán an ceangaltas airgeadais is mó agus is tábhachtaí atá agat

source: When you take out a mortgage, the mortgage lender gets a claim on your property
ga: Nuair a fhaigheann tú morgáiste, faigheann an institiúid iasachtaí éileamh ar do mhaoin

source: If you fall into arrears, your lender may eventually seek to repossess your home
ga: Mura bhfuil tú in ann leanúint le d'aisíocaíochtaí morgáiste, is féidir go ndéanfaidh an institiúid iasachtaí iarracht do theach a athshealbhú ar deireadh

source: If you are having difficulties paying your mortgage, even if you are not actually in arrears, but are in pre-arrears, you should contact your lender’s Arrears Support Unit immediately
ga: Má tá fadhb agat le do mhorgáiste a íoc, fiú muna bhfuil riaráistí agat go fóill, ba chóir duit labhairt le hAonad Tacaíochta Riaráistí d'iasachtóra chomh luath agus is féidir

source: Delaying and allowing mortgage arrears to build up will make the problems worse
ga: Ní theastaíonn ó institiúidí iasachtaí do theach a athshealbhú

source: Your lender does not want to repossess your home
ga: Teastaíonn uathu go leanfá le d'íocaíochtaí

source: It wants you to continue making your payments – repossession is the last resort
ga: Ba chóir go mbeadh athshealbhú do thí mar bheart deiridh ag iasachtóir

source: Lending institutions such as banks are bound by codes of conduct in relation to people who are in mortgage arrears or pre-arrears
ga: Tá institiúidí iasachtaí faoi cheangal ag cóid iompair maidir le daoine a bhfuil deacrachtaí acu morgáiste a íoc

source: Local authorities operate under similar guidelines (pdf)
ga: Oibríonn na húdaráis áitiúla de réir treoirlínte (pdf) atá bunaithe ar na cóid iompair sin

source: In line with these codes, your lender must take certain steps to deal with any problems you have in paying your mortgage
ga: De réir na gcód seo, caithfidh d'iasachtóir céimeanna áirithe a thógáil chun déileáil le fadhbanna ar bith atá agat morgáiste a íoc

source: Under the Central Bank’s Code of Conduct on Mortgage Arrears (CCMA) (pdf), lenders must operate a Mortgage Arrears Resolution Process (MARP) when dealing with customers in mortgage arrears and pre-arrears
ga: Faoi Chód Iompraíochta ar Riaráistí Morgáiste (CIRM) (pdf), ní mór d’iasachtóirí Próiseas Réitigh do Riaráistí Morgáiste (MARP).a úsáid agus iad ag déileáil le custaiméirí riaráiste agus réamh-riaráistí

source: Read more on keepingyourhome.ie
ga: Léigh tuilleadh ar keepingyourhome.ie

source: Other loans and debts
ga: Iasachtaí agus fiachais eile

source: Even if if you are not in mortgage arrears, or have no mortgage at all, your home could be in danger of repossession if you have other debts
ga: Fiú mura bhfuil riaraistí morgáiste agat, d’fhéadfadh baol athshealbhaithe a bheith ann má tá fiachais eile agat

source: If you build up other debts and are unable to repay them, then the people to whom you owe money may register that debt as a 'judgment mortgage' against your home and seek to recover their money in that way (see our document on repossession)
ga: Má charnaíonn tú fiachais eile agus nach bhfuil tú ábalta iad a aisíoc, d’fhéadfadh na daoine lena bhfuil airgead le haisíoc agat an fiachas a chlárú mar morgáiste breithiúnais in aghaidh do thí nó d'árasáin agus iarracht a dhéanamh an t-airgead a aisghabháil ar an mbealach sin (féach ar ár ndoiciméad mar gheall ar athshealbhú tí)

source: Read more information on dealing with problem debt in general
ga: Léigh tuilleadh mar gheall ar fhiachas faidhbe

source: As soon as you realise that you have a problem with mortgage arrears or other debt, you can start taking action to deal with it. The Money Advice and Budgeting Service (MABS) can help you to do this, either face-to-face or via the MABS helpline
ga: Chomh luath agus a n-éiríonn deacrachtaí morgáiste nó deacrachtaí eile fiachais, is féidir leat cúnamh a fháil ón tSeirbhís Bhuiséadta agus Chomhairle Airgid (MABS nó SBCA), go díreach in oifig MABS no tríd an líne chabhrach

source: As part of the Mortgage Arrears Resolution Process, your mortgage lender will ask you to document your financial situation on a Standard Financial Statement (pdf)
ga: Mar chuid den Phróiseas Réitigh Riaráistí Morgáiste (PRRM), iarrfaidh d’iasachtóir morgáiste ort do chás airgeadais a dhoiciméadú ar Ráiteas Caighdeánach Airgeadais (pdf)

source: MABS can help you to fill out this statement
ga: Féadfaidh an SBCA cabhrú leat an ráiteas seo a chomhlánú

source: In recent times, MABS has taken on a greater role in offering information, advice and assistance to borrowers in arrears
ga: I measc na mbeart ata ann chun tacú le daoine a bhfuil riaráistí morgáiste acu tá ról níos mó don SBCA chun faisnéis, comhairle agus cúnamh a sholáthar d’iasachtaithe a bhfuil riaráistí acu

source: This role includes a Dedicated Mortgage Arrears service and a Court Mentor service for debtors faced with court proceedings
ga: Rinneadh seirbhís thiomnaithe Riaráistí Morgáiste agus seirbhís Mheantóir Cúirte d’fhéichiúnaithe a raibh imeachtaí cúirte i ndán dóibh a sheoladh an 22 Nollaig 2015

source: In addition, MABS is centrally involved in the Abhaile scheme for people who are in serious mortgage arrears and at risk of losing their home. This scheme provides a range of services to help you to deal with your situation, including financial advice, legal advice and insolvency advice. Read more on mabs.ie
ga: Anuas air sin, ta ról lárnach ag an SBCA i scéim nua chun cabhrú le daoine a bhfuil droch-riaráistí morgáiste acu chun comhairle neamhspleách shaineolach airgeadais agus dlí a fháil, mar chuid den tseirbhís náisiúnta réitigh do riaráistí morgáiste (Abhaile)

source: Find your nearest MABS office, ring the helpline at 0761 07 2000 (9am - 8pm, Monday - Friday) or email: helpline@mabs.ie
ga: Aimsigh d'oifig áitiúil MABS nó glaoigh ar an líne chabhrach ag 0761 07 2000 (9rn - 8in, Luan - Aoine) nó ríomhphost: helpline@mabs.ie

source: Other sources of information and advice
ga: Foinsí eile faisnéise agus comhairle

source: Several other organisations provide information and advice to people facing mortgage arrears and other problem debt
ga: Soláthraíonn roinnt eagraíochtaí eile faisnéis agus comhairle do dhaoine a bhfuil riaráistí morgáiste agus fiachas fadhbach eile i ndán dóibh

source: The Competition and Consumer Protection Commission’s website has a set of FAQs on dealing with mortgage arrears and a step-by-step action plan for dealing with debt in general
ga: Cuimsítear ar láithreán gréasáin an Choimisiúin um Iomaíocht agus Cosaint Tomhaltóirí sraith ceisteanna coitianta maidir le déileáil le riaráistí morgáiste agus plean gníomhaíochta céim ar chéim chun déileáil le fiachas go ginearálta

source: The Free Legal Advice Centres (FLAC) have published a guide to the Code of Conduct on Mortgage Arrears 2013 (pdf)
ga: Tá treoir maidir leis an Cód Iompraíochta ar Riaráistí Morgáiste (pdf) foilsithe agna hIonaid um Chomhairle Dlí in Aisce (FLAC)

source: You may wish to get legal advice on your options and on what happens if the mortgage lender takes steps to repossess your home
ga: B’fhéidir go mbeifeá ag iarraidh comhairle dlí a fháil faoi na roghanna atá agat agus faoi cad a tharlóidh má ghlacann an t-iasachtóir céimeanna chun do theach a athshealbhú

source: FLAC provides free legal advice from a nationwide network of voluntary advice centres, some of which are based in Citizens Information Centres
ga: Tugann FLAC comhairle dlí saor in aisce ó líonra d’ionaid chomhairle dheonacha ar fud na tíre, agus tá cuid acu bunaithe in Ionaid Faisnéise do Shaoránaigh

source: The Legal Aid Board also provides legal advice, but there is a means test for this
ga: D’fhéadfá a bheith in ann teacht ar chomhairle dlí freisin ón mBord um Chúnamh Dlíthiúil, ach tá tástáil acmhainne ann ina leith

source: As part of the Abhaile scheme mentioned above, the Legal Aid Board operates a panel of solicitors to provide legal aid and advice to people who are at risk of losing their home and are referred by MABS
ga: Mar chuid den scéim nua um chomhairle airgeadais agus dlí a luaitear thuas, oibríonn an Bord um Chúnamh Dlíthiúil painéal aturnaetha chun cúnamh agus comhairle dlí a sholáthar do dhaoine atá i mbaol a dteach a chailleadh agus déanann an SBCA iad a atreorú

source: It also operates a “duty solicitor” service to provide court support for insolvent borrowers in repossession proceedings
ga: Oibríonn sí seirbhís “aturnae dualgais”, chomh maith, chun tacaíocht cúirte a sholáthar d’iasachtaithe dócmhainneacha in imeachtaí athshealbhaithe

source: These services are provided for free, under a voucher system
ga: Soláthraítear na seirbhísí seo saor in aisce, faoi chóras dearbháin

source: Other organisations that provide advice and assistance include the Irish Mortgage Holders Organisation (IMHO), New Beginning, Phoenix Project Ireland and StepChange Debt Charity Ireland
ga: I measc na n-eagraíochtaí eile a chuireann comhairle agus cabhair ar fáil, tá Eagraíocht Sealbhóirí Morgáiste na hÉireann (IMHO) , New Beginning, Phoenix Project Ireland agus StepChange Debt Charity Ireland

source: IMHO has arrangements with 2 banking organisations – AIB Group and KBC Bank, whereby customers can contact IMHO for direct assistance (free of charge) in dealing with these banks about their mortgage arrears
ga: Cuireann tionscnamh speisialta ar chumas chustaiméirí Ghrúpa AIB agus KBC Bank IMHO a fhostú chun dul i dteagmháil leis an mbanc ar a son, saor in aisce
